[
    {
        "intent": "Search",
        "intent_category": "SearchCity",
        "user_queries": [
            {
                "query": "What cities can I visit in Japan?",
                "possible_answers": [
                    "Tokyo",
                    "Kyoto",
                    "Osaka",
                    "Hiroshima",
                    "Fukuoka",
                    "Sapporo",
                    "Nara",
                    "Nagoya",
                    "Yokohama",
                    "Kobe",
                    "Okinawa",
                    "Sendai",
                    "Kanazawa",
                    "Nagasaki",
                    "Hakodate",
                    "Takayama",
                    "Matsumoto",
                    "Okayama",
                    "Kumamoto",
                    "Himeji"
                ]
            },
            {
                "query": "What are the must-see cities in Japan?",
                "possible_answers": ["Must-see cities include Tokyo, Kyoto, Osaka, Hiroshima, and Sapporo."]
            },
            {
                "query": "How many days should I spend in each city?",
                "possible_answers": ["Typically, spend 2-4 days in major cities like Tokyo and Kyoto, and 1-2 days in smaller cities."]
            },
            {
                "query": "What's the best travel route for visiting multiple cities?",
                "possible_answers": ["A common route is Tokyo → Kyoto → Osaka → Hiroshima, which is efficient for train travel."]
            },
            {
                "query": "What is the best time of year to visit Japan?",
                "possible_answers": ["The best times are spring (March to May) for cherry blossoms and fall (September to November) for autumn foliage."]
            },
            {
                "query": "Are there any city-specific events or festivals during my visit?",
                "possible_answers": ["Yes, check local calendars for events like Gion Matsuri in Kyoto or Sapporo Snow Festival."]
            },
            {
                "query": "What are the best neighborhoods to stay in each city?",
                "possible_answers": ["In Tokyo, consider Shinjuku or Shibuya; in Kyoto, try Gion or Arashiyama; and in Osaka, Namba is great."]
            },
            {
                "query": "I want to find popular cities in Japan.",
                "possible_answers": [
                    "Top cities include Tokyo, Kyoto, and Osaka."
                ]
            },
            {
                "query": "Recommend me some cities to explore in Japan.",
                "possible_answers": [
                    "Consider Sapporo for winter or Okinawa for beaches."
                ]
            },
            {
                "query": "Which cities are best for cherry blossom viewing?",
                "possible_answers": [
                    "Tokyo, Kyoto, and Hirosaki are famous for cherry blossoms."
                ]
            },
            {
                "query": "What are some lesser-known cities in Japan?",
                "possible_answers": [
                    "Check out Kanazawa, Takayama, and Matsumoto."
                ]
            },
            {
                "query": "Which cities have the best nightlife?",
                "possible_answers": [
                    "Tokyo, Osaka, and Fukuoka are great for nightlife."
                ]
            },
            {
                "query": "Where can I find historical cities in Japan?",
                "possible_answers": [
                    "Kyoto and Nara are known for their rich history."
                ]
            }
        ]
    },
    {
        "intent": "Search",
        "intent_category": "SearchFood",
        "user_queries": [
            {
                "query": "What are the best local foods in Tokyo?",
                "possible_answers": [
                    "Sushi",
                    "Ramen",
                    "Tempura",
                    "Monjayaki"
                ]
            },
            {
                "query": "Where can I find ramen in Osaka?",
                "possible_answers": [
                    "Popular spots include Ichiran and Ippudo."
                ]
            },
            {
                "query": "Suggest some famous dishes in Kyoto.",
                "possible_answers": [
                    "Try kaiseki, yudofu, and yuba."
                ]
            },
            {
                "query": "What street foods should I try in Japan?",
                "possible_answers": [
                    "Takoyaki, okonomiyaki, and yakitori are great choices."
                ]
            },
            {
                "query": "What desserts are popular in Japan?",
                "possible_answers": [
                    "Matcha ice cream, mochi, and dorayaki."
                ]
            },
            {
                "query": "Where can I find vegan food in Tokyo?",
                "possible_answers": [
                    "Check out places like T's Tantan and Ain Soph."
                ]
            },
            {
                "query": "What seafood dishes should I try?",
                "possible_answers": [
                    "Sashimi, sushi, and grilled fish are must-tries."
                ]
            },
            {
                "query": "What are the best local dishes to try in each city?",
                "possible_answers": ["Try sushi in Tokyo, kaiseki in Kyoto, okonomiyaki in Osaka, and ramen in Fukuoka."]
            },
            {
                "query": "Where can I find vegan or vegetarian options in Tokyo?",
                "possible_answers": ["Check out T's Tantan for vegan ramen and Ain Soph for various vegan dishes."]
            },
            {
                "query": "Are there any famous food markets to visit?",
                "possible_answers": ["Yes, visit Tsukiji Outer Market in Tokyo and Nishiki Market in Kyoto for local delicacies."]
            },
            {
                "query": "What are some must-try street foods in Osaka?",
                "possible_answers": ["Don't miss takoyaki (octopus balls) and okonomiyaki (savory pancakes) in Dotonbori."]
            },
            {
                "query": "Can you recommend good restaurants in Kyoto?",
                "possible_answers": ["Try Gion Karyo for kaiseki and Ippudo for ramen while in Kyoto."]
            }
        ]
    },
    {
        "intent": "Search",
        "intent_category": "SearchAttractions",
        "user_queries": [
          {
            "query": "What historical sites should I visit in Kyoto?",
            "possible_answers": ["Must-visit sites include Kinkaku-ji (Golden Pavilion), Fushimi Inari Shrine, and Nijo Castle."]
          },
          {
            "query": "What are the top attractions in Tokyo?",
            "possible_answers": ["Top attractions include Shibuya Crossing, Tokyo Tower, and the Senso-ji Temple."]
          },
          {
            "query": "Are there any unique cultural experiences in Osaka?",
            "possible_answers": ["Yes, experience street food in Dotonbori and visit Osaka Castle for historical insights."]
          },
          {
            "query": "What outdoor activities are available in Hokkaido?",
            "possible_answers": ["Popular activities include skiing, hiking in national parks, and visiting hot springs."]
          },
          {
            "query": "Can you recommend family-friendly attractions in Japan?",
            "possible_answers": ["Visit Tokyo Disneyland, Universal Studios Japan in Osaka, and Ueno Zoo in Tokyo."]
          },
          {
            "query": "What are some good day trips from Tokyo?",
            "possible_answers": ["Consider day trips to Nikko, Kamakura, or Mount Fuji for beautiful scenery and historical sites."]
          }
        ]
      },
    {
        "intent": "Search",
        "intent_category": "SearchTransportation",
        "user_queries": [
            {
                "query": "What’s the best way to get around Kyoto?",
                "possible_answers": [
                    "Bicycles, buses, and the subway are convenient options."
                ]
            },
            {
                "query": "How can I travel from Tokyo to Osaka?",
                "possible_answers": [
                    "You can take the Shinkansen (bullet train) or a domestic flight."
                ]
            },
            {
                "query": "Is there a train from Hiroshima to Nagasaki?",
                "possible_answers": [
                    "Yes, take the Shinkansen to Hakata and transfer to a limited express train."
                ]
            },
            {
                "query": "What’s the best transportation for sightseeing in Tokyo?",
                "possible_answers": [
                    "Consider using the subway and buses for easy access."
                ]
            },
            {
                "query": "Are taxis readily available in Japan?",
                "possible_answers": [
                    "Yes, taxis are available but can be expensive."
                ]
            },
            {
                "query": "How do I get to Mount Fuji from Tokyo?",
                "possible_answers": [
                    "You can take a bus or train to the 5th station."
                ]
            },
            {
                "query": "What are the options for airport transfers?",
                "possible_answers": [
                    "Airport limousines, shuttle buses, and trains are available."
                ]
            }
        ]
    },
    {
        "intent": "Search",
        "intent_category": "SearchActivity",
        "user_queries": [
            {
                "query": "What activities can I do in Hokkaido?",
                "possible_answers": [
                    "Skiing, hot springs, and visiting the Sapporo Snow Festival."
                ]
            },
            {
                "query": "Tell me about things to do in Okinawa.",
                "possible_answers": [
                    "Snorkeling, visiting Shurijo Castle, and enjoying beautiful beaches."
                ]
            },
            {
                "query": "What are the must-see attractions in Yokohama?",
                "possible_answers": [
                    "Visit Minato Mirai, Chinatown, and the Cup Noodles Museum."
                ]
            },
            {
                "query": "What cultural experiences are available in Japan?",
                "possible_answers": [
                    "Participate in a tea ceremony, visit a sumo match, or stay in a ryokan."
                ]
            },
            {
                "query": "What outdoor activities can I enjoy in Japan?",
                "possible_answers": [
                    "Hiking, cycling, and hot spring bathing."
                ]
            },
            {
                "query": "What are some unique festivals in Japan?",
                "possible_answers": [
                    "Gion Matsuri in Kyoto, Sapporo Snow Festival, and Nebuta Matsuri in Aomori."
                ]
            },
            {
                "query": "What historical sites should I visit?",
                "possible_answers": [
                    "Hiroshima Peace Memorial, Himeji Castle, and Nijo Castle."
                ]
            }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanAccommodation",
        "user_queries": [
            {
                "query": "What are the best areas to stay in Tokyo?",
                "possible_answers": ["Shinjuku, Shibuya, and Ginza are popular areas with good access to transportation."]
            },
            {
                "query": "Can you recommend unique accommodations in Kyoto?",
                "possible_answers": ["Consider staying in a traditional ryokan or a machiya (townhouse)."]
            },
            {
                "query": "What are the best family-friendly hotels in Japan?",
                "possible_answers": ["Look for hotels that offer family rooms and kid-friendly amenities, such as the Hotel Granvia Kyoto."]
            },
            {
                "query": "How do I find budget accommodation in Osaka?",
                "possible_answers": ["Use apps like Booking.com or Airbnb to find affordable options."]
            },
            {
                "query": "Are hostels a good option in Japan?",
                "possible_answers": ["Yes, hostels are popular and often provide a social atmosphere, especially in cities like Tokyo and Osaka."]
            }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanCity",
        "user_queries": [
            {
                "query": "I want to plan a trip to Tokyo.",
                "possible_answers": [
                    "Consider 4-5 days to explore attractions like Shibuya, Shinjuku, and Asakusa."
                ]
            },
            {
                "query": "Help me create an itinerary for Kyoto.",
                "possible_answers": [
                    "Visit Kinkaku-ji, Fushimi Inari Shrine, and Arashiyama Bamboo Grove."
                ]
            },
            {
                "query": "How can I spend 3 days in Osaka?",
                "possible_answers": [
                    "Day 1: Osaka Castle, Day 2: Universal Studios, Day 3: Dotonbori."
                ]
            },
            {
                "query": "What’s a good route for traveling through Japan?",
                "possible_answers": [
                    "Start in Tokyo, visit Kyoto, then head to Osaka and Hiroshima."
                ]
            },
            {
                "query": "What should I include in a week-long itinerary?",
                "possible_answers": [
                    "Tokyo, Kyoto, Osaka, and Hiroshima are great stops."
                ]
            },
            {
                "query": "How can I explore the countryside in Japan?",
                "possible_answers": [
                    "Consider visiting Shirakawa-go and the Japanese Alps."
                ]
            },
            {
                "query": "What are the best places to stay in Tokyo?",
                "possible_answers": [
                    "Shinjuku, Shibuya, and Ginza offer great accommodations."
                ]
            }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanFood",
        "user_queries": [
            {
                "query": "I want to book a food tour in Tokyo.",
                "possible_answers": [
                    "Look for tours that include sushi, izakayas, and street food."
                ]
            },
            {
                "query": "Can you suggest a restaurant in Hiroshima?",
                "possible_answers": [
                    "Try Okonomi-mura for a variety of okonomiyaki options."
                ]
            },
            {
                "query": "Help me plan meals for my trip to Japan.",
                "possible_answers": [
                    "Include sushi, ramen, kaiseki, and local street foods in your itinerary."
                ]
            },
            {
                "query": "What are the best vegetarian options in Japan?",
                "possible_answers": [
                    "Explore shojin ryori (Buddhist vegetarian cuisine) and find vegan ramen."
                ]
            },
            {
                "query": "Where can I find the best sushi in Tokyo?",
                "possible_answers": [
                    "Check out Sukiyabashi Jiro or Sushi Saito."
                ]
            },
            {
                "query": "What food festivals should I attend in Japan?",
                "possible_answers": [
                    "Sapporo Snow Festival and Tokyo Ramen Show are popular."
                ]
            },
            {
                "query": "Can you recommend a local dish for each region?",
                "possible_answers": [
                    "Hokkaido: seafood; Osaka: takoyaki; Kyoto: kaiseki."
                ]
            }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanTransportation",
        "user_queries": [
            {
                "query": "How do I get a Japan Rail Pass?",
                "possible_answers": [
                    "You can purchase online or at JR stations."
                ]
            },
            {
                "query": "What’s the best way to travel between cities?",
                "possible_answers": [
                    "The Shinkansen is the fastest option for long distances."
                ]
            },
            {
                "query": "How can I use public transport in Tokyo?",
                "possible_answers": [
                    "Buy a Suica or Pasmo card for easy travel."
                ]
            },
            {
                "query": "What are the options for airport transfers?",
                "possible_answers": [
                    "Airport limousines, shuttle buses, and trains are available."
                ]
            },
            {
                "query": "How to navigate the subway system in Osaka?",
                "possible_answers": [
                    "Use a map or app to understand the lines."
                ]
            },
            {
                "query": "Are buses available in rural areas?",
                "possible_answers": [
                    "Yes, but schedules may be less frequent."
                ]
            },
            {
                "query": "What’s the easiest way to get around Kyoto?",
                "possible_answers": [
                    "Renting a bicycle is a popular choice."
                ]
            }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanTravel",
        "user_queries": [
          {
            "query": "How do I find accommodations in Japan?",
            "possible_answers": ["Use booking websites like Booking.com, Airbnb, or local guesthouses for various accommodation options."]
          },
          {
            "query": "What’s the best way to travel between cities?",
            "possible_answers": ["The Shinkansen (bullet train) is the fastest and most efficient way to travel between cities."]
          },
          {
            "query": "Are there any discounts for train travel in Japan?",
            "possible_answers": ["Yes, consider the Japan Rail Pass for unlimited travel on JR trains for a set number of days."]
          },
          {
            "query": "How do I navigate public transportation in Tokyo?",
            "possible_answers": ["Use the Tokyo Metro app for maps and schedules; prepaid Suica or Pasmo cards make travel easy."]
          },
          {
            "query": "Is it easy to rent a car for city travel?",
            "possible_answers": ["Yes, but parking can be expensive and limited in cities; public transport is often more convenient."]
          },
          {
            "query": "What transportation options are available from the airport to the city center?",
            "possible_answers": ["Options include airport limousines, shuttle buses, and trains like the Narita Express or the Airport Limousine Bus."]
          }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanActivity",
        "user_queries": [
            {
                "query": "What activities can I do in Tokyo?",
                "possible_answers": [
                    "Visit Tokyo Tower, explore Akihabara, and enjoy a sumo match."
                ]
            },
            {
                "query": "What unique experiences can I have in Kyoto?",
                "possible_answers": [
                    "Try a tea ceremony and visit a geisha district."
                ]
            },
            {
                "query": "What are the best outdoor activities in Japan?",
                "possible_answers": [
                    "Hiking in the Japanese Alps and visiting hot springs."
                ]
            },
            {
                "query": "What cultural activities should I include in my itinerary?",
                "possible_answers": [
                    "Consider a kimono rental and visiting a traditional onsen."
                ]
            },
            {
                "query": "What festivals are happening in Japan this year?",
                "possible_answers": [
                    "Check local schedules for Gion Matsuri and Nebuta Matsuri."
                ]
            },
            {
                "query": "What museums should I visit in Tokyo?",
                "possible_answers": [
                    "The Tokyo National Museum and the Ghibli Museum are must-sees."
                ]
            },
            {
                "query": "What are some family-friendly activities in Japan?",
                "possible_answers": [
                    "Visit Universal Studios in Osaka or the Ueno Zoo in Tokyo."
                ]
            }
        ]
    },
    {
        "intent": "Plan",
        "intent_category": "PlanBudget",
        "user_queries": [
            {
                "query": "How much should I budget for a week in Japan?",
                "possible_answers": ["A budget traveler might spend around $700-$1000, while a mid-range traveler could spend $1500-$2500."]
            },
            {
                "query": "What’s the average cost of accommodation in Japan?",
                "possible_answers": ["Budget hotels can range from $50-$100 per night, while mid-range hotels can cost $100-$250."]
            },
            {
                "query": "How much should I expect to spend on food per day?",
                "possible_answers": ["Budget around $20-$30 for cheap eats, $40-$70 for mid-range dining, and more for upscale restaurants."]
            },
            {
                "query": "Are there any discounts available for tourists?",
                "possible_answers": ["Yes, many attractions offer discounts with a Japan Rail Pass or special tourist tickets."]
            },
            {
                "query": "What are some money-saving tips for traveling in Japan?",
                "possible_answers": ["Use a Suica card for public transport, eat at convenience stores, and consider budget accommodation options."]
            }
        ]
    },
    {
        "intent": "Experience",
        "intent_category": "CulturalExperience",
        "user_queries": [
          {
            "query": "How can I experience traditional Japanese culture in Kyoto?",
            "possible_answers": ["Consider staying in a ryokan, attending a tea ceremony, or visiting historic temples and shrines."]
          },
          {
            "query": "What are the best places to see cherry blossoms?",
            "possible_answers": ["Top spots include Ueno Park in Tokyo, Maruyama Park in Kyoto, and Hirosaki Park in Aomori."]
          },
          {
            "query": "Are there any tea ceremonies or sumo matches I can attend?",
            "possible_answers": ["Yes, many tea houses offer ceremonies, and sumo tournaments are held throughout the year."]
          },
          {
            "query": "What festivals should I plan my trip around?",
            "possible_answers": ["Attend Gion Matsuri in July, Nebuta Matsuri in August, and the Sapporo Snow Festival in February."]
          },
          {
            "query": "Where can I find traditional ryokans to stay?",
            "possible_answers": ["Search in areas like Kyoto, Hakone, and Takayama for authentic ryokan experiences."]
          }
        ]
    },
    {
        "intent": "TravelInfo",
        "intent_category": "GeneralTravel",
        "user_queries": [
          {
            "query": "What’s the best way to exchange currency in Japan?",
            "possible_answers": ["Exchange currency at airports, banks, or use ATMs that accept foreign cards."]
          },
          {
            "query": "Do I need a visa to visit Japan?",
            "possible_answers": ["Visa requirements depend on your nationality; check with the Japanese consulate for specifics."]
          },
          {
            "query": "What should I know about Japanese customs and etiquette?",
            "possible_answers": ["Be polite, bow when greeting, remove shoes when entering homes, and be respectful in public."]
          },
          {
            "query": "Is it safe to travel alone in Japan?",
            "possible_answers": ["Yes, Japan is generally safe for solo travelers, with low crime rates and helpful locals."]
          },
          {
            "query": "How can I stay connected to the internet while traveling?",
            "possible_answers": ["Consider renting a portable Wi-Fi device or buying a local SIM card for internet access."]
          }
        ]
    }
]
